renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_cmtw_rx/src/r_cmtw_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2014 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_cmtw_rx.c
* Description  : This module creates a timer tick using a CMTW channel based on an input by the user.
*              : The module also supports output compare and input capture features to generate
*              : waveforms and detect external events.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 29.08.2014 1.00    First GSCE Release.
*         : 01.02.2019 1.40    Supported RX65N-64pin.
*                              Corrected interrupt priority level macro names.
*                              Fixed GSCE Code Checker errors.
*         : 20.05.2019 2.00    Added support for GNUC and ICCRX.
*         : 15.08.2019 2.10    Fixed warnings in IAR.
*         : 30.12.2019 2.20    Added support RX66N, RX72N.
*                              Modified comment of API function to Doxygen style.
*                              Added support for atomic control.
*                              Removed support for Generation 1 devices.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include <stdio.h>

#include "platform.h"
/* Configuration for this module. */
#include "r_cmtw_rx_config.h"
/* Header file for this module. */
#include "r_cmtw_rx_if.h"
/* Internal definitions */
#include "r_cmtw_rx_private.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define CMTW_COUNTF_MIN             (0x00000001)
#define CMTW_COUNTF_MAX             (0xFFFFFFFF)

#define CMTW_ACTION_ISR_ENABLE_MASK     (CMTW_ACTION_INTERRUPT | CMTW_ACTION_CALLBACK | CMTW_ACTION_ONESHOT)

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
#if CMTW_CFG_USE_CH0 == 1
/* Channel ROM info */
const cmtw_prv_ch_rom_info_t g_cmtw_rom_ch0 =
{
    &(CMTW0),                           /* Pointer to the registers */
    CMTW_CHANNEL_0,                     /* Channel */
    BIT1_MASK,                          /* MSTP mask bit */
    CMTW_CFG_IPR_CM_CH0,                /* Compare match interrupt priority level */
    CMTW_CFG_IPR_OC0_CH0,               /* Output Compare 0 interrupt priority level */
    CMTW_CFG_IPR_OC1_CH0,               /* Output Compare 1 interrupt priority level */
    CMTW_CFG_IPR_IC0_CH0,               /* Input capture 0 interrupt priority level */
    CMTW_CFG_IPR_IC1_CH0,               /* Input capture 1 interrupt priority level */
    &ICU.IR[IR_CMTW0_CMWI0].BYTE,       /* Pointer to compare match ICU IR register */
    &ICU.IPR[IPR_CMTW0_CMWI0].BYTE,     /* Pointer to compare match ICU IPR register */
    &ICU.IER[IER_CMTW0_CMWI0].BYTE,     /* Pointer to compare match ICU IER register */
    IEN_CMTW0_CMWI0,                    /* Compare match IEN mask bit */
    &ICU.IR[IR_CMTW0_OC0I0].BYTE,       /* Pointer to output compare 0 ICU IR register */
    &ICU.IPR[IPR_CMTW0_OC0I0].BYTE,     /* Pointer to output compare 0 ICU IPR register */
    &ICU.IER[IER_CMTW0_OC0I0].BYTE,     /* Pointer to output compare 0 ICU IER register */
    IEN_CMTW0_OC0I0,                    /* Output compare 0 IEN mask bit */
    &ICU.IR[IR_CMTW0_OC1I0].BYTE,       /* Pointer to output compare 1 ICU IR register */
    &ICU.IPR[IPR_CMTW0_OC1I0].BYTE,     /* Pointer to output compare 1 ICU IPR register */
    &ICU.IER[IER_CMTW0_OC1I0].BYTE,     /* Pointer to output compare 1 ICU IER register */
    IEN_CMTW0_OC1I0,                    /* Output compare 1 IEN mask bit */
    &ICU.IR[IR_CMTW0_IC0I0].BYTE,       /* Pointer to input capture 0 ICU IR register */
    &ICU.IPR[IPR_CMTW0_IC0I0].BYTE,     /* Pointer to input capture 0 ICU IPR register */
    &ICU.IER[IER_CMTW0_IC0I0].BYTE,     /* Pointer to input capture 0 ICU IER register */
    IEN_CMTW0_IC0I0,                    /* Input capture 0 IEN mask bit */
    &ICU.IR[IR_CMTW0_IC1I0].BYTE,       /* Pointer to input capture 0 ICU IR register */
    &ICU.IPR[IPR_CMTW0_IC1I0].BYTE,     /* Pointer to input capture 0 ICU IPR register */
    &ICU.IER[IER_CMTW0_IC1I0].BYTE,     /* Pointer to input capture 0 ICU IER register */
    IEN_CMTW0_IC1I0,                    /* Input capture 1 IEN mask bit */
};

/* Channel control info */
static cmtw_prv_ch_ctrl_info_t g_cmtw_ctrl_ch0 =
{
    &g_cmtw_rom_ch0,                    /* Pointer to ROM info */
    NULL,                               /* Pointer to callback */
    CMTW_PRV_CHANNEL_STATE_CLOSED,      /* Channel state */
    CMTW_ACTION_NONE,                   /* Compare match action */
    CMTW_ACTION_NONE,                   /* Output compare 0 action */
    CMTW_ACTION_NONE,                   /* Output compare 1 action */
    CMTW_ACTION_NONE,                   /* Input capture 0 action */
    CMTW_ACTION_NONE,                   /* Input capture 1 action */
};
