renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_cmtw_rx/src/r_cmtw_rx.c
#endif /* End of #if CMTW_CFG_USE_CH0 == 1 */

#if CMTW_CFG_USE_CH1 == 1
/* Channel ROM info */
const cmtw_prv_ch_rom_info_t g_cmtw_rom_ch1 =
{
    &(CMTW1),                           /* Pointer to the registers */
    CMTW_CHANNEL_1,                     /* Channel */
    BIT0_MASK,                          /* MSTP mask bit */
    CMTW_CFG_IPR_CM_CH1,                /* Compare match interrupt priority level */
    CMTW_CFG_IPR_OC0_CH1,               /* Output Compare 0 interrupt priority level */
    CMTW_CFG_IPR_OC1_CH1,               /* Output Compare 1 interrupt priority level */
    CMTW_CFG_IPR_IC0_CH1,               /* Input capture 0 interrupt priority level */
    CMTW_CFG_IPR_IC1_CH1,               /* Input capture 1 interrupt priority level */
    &ICU.IR[IR_CMTW1_CMWI1].BYTE,       /* Pointer to compare match ICU IR register */
    &ICU.IPR[IPR_CMTW1_CMWI1].BYTE,     /* Pointer to compare match ICU IPR register */
    &ICU.IER[IER_CMTW1_CMWI1].BYTE,     /* Pointer to compare match ICU IER register */
    IEN_CMTW1_CMWI1,                    /* Compare match IEN mask bit */
    &ICU.IR[IR_CMTW1_OC0I1].BYTE,       /* Pointer to output compare 0 ICU IR register */
    &ICU.IPR[IPR_CMTW1_OC0I1].BYTE,     /* Pointer to output compare 0 ICU IPR register */
    &ICU.IER[IER_CMTW1_OC0I1].BYTE,     /* Pointer to output compare 0 ICU IER register */
    IEN_CMTW1_OC0I1,                    /* Output compare 0 IEN mask bit */
    &ICU.IR[IR_CMTW1_OC1I1].BYTE,       /* Pointer to output compare 1 ICU IR register */
    &ICU.IPR[IPR_CMTW1_OC1I1].BYTE,     /* Pointer to output compare 1 ICU IPR register */
    &ICU.IER[IER_CMTW1_OC1I1].BYTE,     /* Pointer to output compare 1 ICU IER register */
    IEN_CMTW1_OC1I1,                    /* Output compare 1 IEN mask bit */
    &ICU.IR[IR_CMTW1_IC0I1].BYTE,       /* Pointer to input capture 0 ICU IR register */
    &ICU.IPR[IPR_CMTW1_IC0I1].BYTE,     /* Pointer to input capture 0 ICU IPR register */
    &ICU.IER[IER_CMTW1_IC0I1].BYTE,     /* Pointer to input capture 0 ICU IER register */
    IEN_CMTW1_IC0I1,                    /* Input capture 0 IEN mask bit */
    &ICU.IR[IR_CMTW1_IC1I1].BYTE,       /* Pointer to input capture 0 ICU IR register */
    &ICU.IPR[IPR_CMTW1_IC1I1].BYTE,     /* Pointer to input capture 0 ICU IPR register */
    &ICU.IER[IER_CMTW1_IC1I1].BYTE,     /* Pointer to input capture 0 ICU IER register */
    IEN_CMTW1_IC1I1,                    /* Input capture 1 IEN mask bit */
};

/* Channel control info */
static cmtw_prv_ch_ctrl_info_t g_cmtw_ctrl_ch1 =
{
    &g_cmtw_rom_ch1,                    /* Pointer to ROM info */
    NULL,                               /* Pointer to callback */
    CMTW_PRV_CHANNEL_STATE_CLOSED,      /* Channel state */
    CMTW_ACTION_NONE,                   /* Compare match action */
    CMTW_ACTION_NONE,                   /* Output compare 0 action */
    CMTW_ACTION_NONE,                   /* Output compare 1 action */
    CMTW_ACTION_NONE,                   /* Input capture 0 action */
    CMTW_ACTION_NONE,                   /* Input capture 1 action */
};
#endif /* End of #if CMTW_CFG_USE_CH1 == 1 */

cmtw_prv_ch_ctrl_info_t * const g_cmtw_handles[] =
{
    #if CMTW_CFG_USE_CH0 == 1
    &g_cmtw_ctrl_ch0,
    #else
    NULL,
    #endif
    #if CMTW_CFG_USE_CH1 == 1
    &g_cmtw_ctrl_ch1,
    #else
    NULL,
    #endif
};

static const uint32_t g_cmtw_clock_divisors[] = {8, 32, 128, 512};
static const float g_cmtw_time_units[] = {1e-9, 1e-6, 1e-3, 1};

static void power_on(cmtw_prv_ch_ctrl_info_t  * const hdl);
static void power_off(cmtw_prv_ch_ctrl_info_t  * const hdl);
static uint32_t calculate_count(cmtw_time_unit_t time_unit, cmtw_clock_divisor_t clock_divisor, uint32_t time);
static void cmtw_isr_common(cmtw_event_t event, uint32_t count, cmtw_prv_ch_ctrl_info_t * const hdl);

/***********************************************************************************************************************
* Function Name: R_CMTW_Open
********************************************************************************************************************//**
* @brief This function powers up the specified CMTW channel, initializes the associated CMTW registers and enables
* interrupts if requested.  Takes a callback function pointer for responding to interrupt events.  After successful
* completion, the channel moves to open state.  This function must be called before calling any other API functions.
* @param[in] channel Number of the CMTW channel to initialize
* @param[in] pconfig Pointer to the CMTW channel settings data structure
* @param[in] pcallback Pointer to the user function to call from the interrupt
* @retval CMTW_SUCCESS Successful, channel is initialized
* @retval CMTW_ERR_BAD_CHAN Invalid channel number
* @retval CMTW_ERR_CH_NOT_ENABLED Channel is disabled by user configuration
* @retval CMTW_ERR_CH_NOT_CLOSED Channel currently in operation, perform R_CMTW_Close() first
* @retval CMTW_ERR_INVALID_ARG An element of the pconfig structure contains an invalid value
* @retval CMTW_ERR_OUT_OF_RANGE Calculated count value is not in range
* @retval CMTW_ERR_NULL_PTR Either pconfig or pcallback is null
* @retval CMTW_ERR_LOCK The lock could not be acquired, the channel is busy
* @details This function sets up a CMTW channel.  After completion of the open function the CMTW channel will be
* initialized and ready to be started by calling R_CMTW_Control().  This function must be called once prior to calling
* any other CMTW API functions. Once successfully completed, the status of the selected CMTW channel will be set
* to "open".  After that this function should not be called again for the same CMTW channel without first performing
* a "close" by calling R_CMTW_Close().
* @note None
*/
cmtw_err_t    R_CMTW_Open(cmtw_channel_t          channel,
                          cmtw_channel_settings_t *pconfig,
                          void                    (* const pcallback)(void *pdata))
{
    cmtw_prv_ch_ctrl_info_t *hdl;
    uint32_t                count;


#if CMTW_CGF_REQUIRE_LOCK == 1
    bool lock_result;
#endif

#if CMTW_CFG_PARAM_CHECKING_ENABLE == 1
    /* Parameter check - channel */
    if (CMTW_CHANNEL_MAX <= channel)
    {
        return(CMTW_ERR_BAD_CHAN);
    }

