renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_cmtw_rx/src/r_cmtw_rx.c
    *hdl->rom->ir_oc0 = 0;
    *hdl->rom->ipr_oc0 = 0;
    (*hdl->rom->ier_oc0) &= (~hdl->rom->oc0_enable_mask);

    *hdl->rom->ir_oc1 = 0;
    *hdl->rom->ipr_oc1 = 0;
    (*hdl->rom->ier_oc1) &= (~hdl->rom->oc1_enable_mask);

    *hdl->rom->ir_ic0 = 0;
    *hdl->rom->ipr_ic0 = 0;
    (*hdl->rom->ier_ic0) &= (~hdl->rom->ic0_enable_mask);

    *hdl->rom->ir_ic1 = 0;
    *hdl->rom->ipr_ic1 = 0;
    (*hdl->rom->ier_ic1) &= (~hdl->rom->ic1_enable_mask);

    /* Change state to closed */
    hdl->state = CMTW_PRV_CHANNEL_STATE_CLOSED;

    /* Turn power off to the channel */
    power_off(hdl);

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Release lock for this channel */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + (uint8_t)channel));
#endif


    return(CMTW_SUCCESS);
}  /* End of function R_CMTW_Close() */

/***********************************************************************************************************************
* Function Name: R_CMTW_Control
********************************************************************************************************************//**
* @brief This function starts, stops, resumes, or restarts a CMTW channel that is in the open state.
* @param[in] channel Number of the CMTW channel to control
* @param[in] cmd Enumerated command codes:\n
* CMTW_CMD_START: Activate the timer\n
* CMTW_CMD_RESUME: Same as start\n
* CMTW_CMD_STOP: Pause the timer\n
* CMTW_CMD_RESTART: Zero the counter then activate the timer
* @retval CMTW_SUCCESS Successful, the command is executed
* @retval CMTW_ERR_BAD_CHAN Invalid channel number
* @retval CMTW_ERR_CH_NOT_ENABLED Channel is disabled by user configuration
* @retval CMTW_ERR_CH_NOT_OPENED Channel currently closed, perform R_CMTW_Open() first
* @retval CMTW_ERR_CH_NOT_RUNNIG Channel currently not started - perform R_CMTW_Control() to start
* @retval CMTW_ERR_CH_NOT_STOPPED Channel currently running - perform R_CMTW_Control() to stop
* @retval CMTW_ERR_UNKNOWN_CMD Invalid command
* @retval CMTW_ERR_LOCK The lock could not be acquired, the channel is busy
* @details This function starts or resumes a CMTW channel that is in the open state.  Once successfully completed, the
* status of the selected CMTW channel will be set to "running".  Stop command pauses a channel that is in a running state.
* In this state the timer registers retain their values immediately before executing the stop command.  Timer operations
* can be continued by start or resume commands.  The restart command clears the timer counter and resumes the operations.
* @note None
*/
cmtw_err_t    R_CMTW_Control(cmtw_channel_t     channel,
                             cmtw_cmd_t         cmd)
{
    cmtw_prv_ch_ctrl_info_t *hdl;

#if CMTW_CGF_REQUIRE_LOCK == 1
    bool lock_result;
#endif

#if CMTW_CFG_PARAM_CHECKING_ENABLE == 1
    /* Parameter check - channel */
    if (CMTW_CHANNEL_MAX <= channel)
    {
        return(CMTW_ERR_BAD_CHAN);
    }

    /* Parameter check - cmd */
    if (CMTW_CMD_MAX <= cmd)
    {
        return(CMTW_ERR_UNKNOWN_CMD);
    }
#endif

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Get lock for this channel */
    lock_result = R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_CMTW0 + (uint8_t)channel));

    if (false == lock_result)
    {
        return(CMTW_ERR_LOCK);
    }
#endif

    /* Get the handle for the channel - pointer to the channel control info */
    hdl = g_cmtw_handles[channel];

    /* Check if channel enabled */
    if (NULL == hdl)
    {
#if CMTW_CGF_REQUIRE_LOCK == 1
        /* Release lock for this channel */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + (uint8_t)channel));
#endif
        return (CMTW_ERR_CH_NOT_ENABLED);
    }

    /* Check channel state */
    if (CMTW_PRV_CHANNEL_STATE_CLOSED == hdl->state)
    {
#if CMTW_CGF_REQUIRE_LOCK == 1
        /* Release lock for this channel */
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + (uint8_t)channel));
#endif
        return(CMTW_ERR_CH_NOT_OPENED);
    }
    else if (CMTW_PRV_CHANNEL_STATE_OPENED == hdl->state)
    {
        if (CMTW_CMD_STOP == cmd)
        {
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + (uint8_t)channel));
#endif
            return (CMTW_ERR_CH_NOT_RUNNIG);
        }
    }
    else if (CMTW_PRV_CHANNEL_STATE_RUNNING == hdl->state)
    {
        if ((CMTW_CMD_START == cmd) || (CMTW_CMD_RESUME == cmd))
        {
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + (uint8_t)channel));
#endif
            return (CMTW_ERR_CH_NOT_STOPPED);
        }
    }
    else
    {
        /* Do nothing */
        R_BSP_NOP();
    }

    /* Process the command */
    switch (cmd)
    {
        /* Both start and resume do the same thing - start the timers of the this channel */
        case CMTW_CMD_START:
        case CMTW_CMD_RESUME:
            {
            hdl->rom->regs->CMWSTR.BIT.STR = 1;
            hdl->state = CMTW_PRV_CHANNEL_STATE_RUNNING;
            }
        break;

        /* Stop the timers of the this channel */
        case CMTW_CMD_STOP:
            {
            hdl->rom->regs->CMWSTR.BIT.STR = 0;
            hdl->state = CMTW_PRV_CHANNEL_STATE_OPENED;
            }
        break;

        /* Clears the counter and starts the timers of this channel */
        case CMTW_CMD_RESTART:
            {
            hdl->rom->regs->CMWSTR.BIT.STR = 0;
            hdl->rom->regs->CMWCNT = 0;
            hdl->rom->regs->CMWSTR.BIT.STR = 1;
            hdl->state = CMTW_PRV_CHANNEL_STATE_RUNNING;
            }
        break;

        default:
            {
#if CMTW_CGF_REQUIRE_LOCK == 1
            /* Release lock for this channel */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + (uint8_t)channel));
#endif
            return(CMTW_ERR_UNKNOWN_CMD);
            }
        break;
    }

#if CMTW_CGF_REQUIRE_LOCK == 1
    /* Release lock for this channel */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMTW0 + (uint8_t)channel));
#endif

    return(CMTW_SUCCESS);
} /* End of function R_CMTW_Control() */

