renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_cmtw_rx/src/r_cmtw_rx.c
/***********************************************************************************************************************
* Function Name: R_CMTW_GetVersion
********************************************************************************************************************//**
* @brief This function returns the driver version number at runtime.
* @return Version_number with major and minor version digits packed into a single 32-bit value.
* @details This function returns the version of this module. The version number is encoded such that the top 2 bytes are
* the major version number and the bottom 2 bytes are the minor version number.
* @note None
*/
uint32_t R_CMTW_GetVersion (void)
{
    /* These version macros are defined in r_cmtw_rx_if.h. */
    return((((uint32_t)CMTW_RX_VERSION_MAJOR) << 16) | (uint32_t)CMTW_RX_VERSION_MINOR);
} /* End of function R_CMTW_GetVersion() */

/***********************************************************************************************************************
* Function Name: power_on
* Description  : Provides power to the channel specified by the handle.
* Arguments    : hdl -
*                   handle for the channel
* Return Value : none
***********************************************************************************************************************/
static void power_on(cmtw_prv_ch_ctrl_info_t  * const hdl)
{
    
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    /* Power on CMTW */
    SYSTEM.MSTPCRA.LONG &= (~hdl->rom->stop_mask);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of function power_on() */

/***********************************************************************************************************************
* Function Name: power_off
* Description  : Removes power from the channel specified by the handle.
* Arguments    : hdl -
*                   handle for the channel
* Return Value : none
***********************************************************************************************************************/
static void power_off(cmtw_prv_ch_ctrl_info_t  * const hdl)
{
    
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    /* Power off CMTW */
    SYSTEM.MSTPCRA.LONG |= hdl->rom->stop_mask;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of function power_off() */

/***********************************************************************************************************************
* Function Name: calculate_count
* Description  : Calculates the timer count.
* Arguments    : time_unit -
*                   time base
*                clock_divisor -
*                   time clock divisor
*                time -
*                   request time value
* Return Value : count
*                   timer tick count if in range, 0 otherwise
***********************************************************************************************************************/
static uint32_t calculate_count(cmtw_time_unit_t time_unit, cmtw_clock_divisor_t clock_divisor, uint32_t time)
{
    uint32_t divisor;
    uint32_t count;
    float countf;
    float unit;

    unit = g_cmtw_time_units[time_unit];
    divisor = g_cmtw_clock_divisors[clock_divisor];
    countf = ((BSP_PCLKB_HZ / divisor) * time * unit) - 1;

    /* Check if count is in range */
    if ((countf < CMTW_COUNTF_MIN) || (countf > CMTW_COUNTF_MAX))
    {
        count = 0;
    }
    else
    {
        /* Round up the count if necessary */
        if ((uint32_t)(countf*2) == ((uint32_t)(countf)*2))
        {
            /* Casting to uint32_t is valid */
            count = (uint32_t)countf;
        }
        else
        {
            /* Casting to uint32_t is valid */
            count = (uint32_t)(countf) + 1;
        }
    }

    return(count);
} /* End of function calculate_count() */

#if CMTW_CFG_USE_CH0 == 1
/***********************************************************************************************************************
* Function Name: cmtw_cm_ch0_isr
* Description  : Compare match interrupt handler for channel 0.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(cmtw_cm_ch0_isr,VECT(CMTW0, CMWI0))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmtw_cm_ch0_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_0];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->cm_action)
    {
        count = hdl->rom->regs->CMWCOR;
        cmtw_isr_common(CMTW_EVENT_CM, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->cm_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWCR.BIT.CMWIE = 0;
        hdl->rom->regs->CMWIOR.BIT.CMWE = 0;
    }
} /* End of function cmtw_cm_ch0_isr() */

