renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_cmtw_rx/src/r_cmtw_rx.c
/***********************************************************************************************************************
* Function Name: cmtw_oc0_ch0_isr
* Description  : Output compare 0 interrupt handler for channel 0.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(cmtw_oc0_ch0_isr, VECT_CMTW0_OC0I0)
R_BSP_ATTRIB_STATIC_INTERRUPT void cmtw_oc0_ch0_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_0];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->oc0_action)
    {
        count = hdl->rom->regs->CMWOCR0;
        cmtw_isr_common(CMTW_EVENT_OC0, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->oc0_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWIOR.BIT.OC0 = 0;
        hdl->rom->regs->CMWCR.BIT.OC0IE = 0;
        hdl->rom->regs->CMWIOR.BIT.OC0E = 0;
    }
} /* End of function cmtw_oc0_ch0_isr() */

/***********************************************************************************************************************
* Function Name: cmtw_oc1_ch0_isr
* Description  : Output compare 1 interrupt handler for channel 0.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(cmtw_oc1_ch0_isr,VECT_CMTW0_OC1I0)
R_BSP_ATTRIB_STATIC_INTERRUPT void cmtw_oc1_ch0_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_0];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->oc1_action)
    {
        count = hdl->rom->regs->CMWOCR1;
        cmtw_isr_common(CMTW_EVENT_OC1, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->oc1_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWIOR.BIT.OC1 = 0;
        hdl->rom->regs->CMWCR.BIT.OC1IE = 0;
        hdl->rom->regs->CMWIOR.BIT.OC1E = 0;
    }
} /* End of function cmtw_oc1_ch0_isr() */

/***********************************************************************************************************************
* Function Name: cmtw_ic0_ch0_isr
* Description  : Input capture 0 interrupt handler for channel 0.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(cmtw_ic0_ch0_isr, VECT_CMTW0_IC0I0)
R_BSP_ATTRIB_STATIC_INTERRUPT void cmtw_ic0_ch0_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_0];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->ic0_action)
    {
        count = hdl->rom->regs->CMWICR0;
        cmtw_isr_common(CMTW_EVENT_IC0, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->ic0_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWCR.BIT.IC0IE = 0;
        hdl->rom->regs->CMWIOR.BIT.IC0E = 0;
    }
} /* End of function cmtw_ic0_ch0_isr() */

/***********************************************************************************************************************
* Function Name: cmtw_ic1_ch0_isr
* Description  : Input capture 1 interrupt handler for channel 0.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(cmtw_ic1_ch0_isr, VECT_CMTW0_IC1I0)
R_BSP_ATTRIB_STATIC_INTERRUPT void cmtw_ic1_ch0_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_0];

    /* Call user callback if requested */
    if (CMTW_ACTION_CALLBACK & hdl->ic1_action)
    {
        count = hdl->rom->regs->CMWICR1;
        cmtw_isr_common(CMTW_EVENT_IC1, count, hdl);
    }

    /* Disable if repeat not requested e.g. one-shot */
    if (CMTW_ACTION_ONESHOT & hdl->ic1_action)
    {
        /* Disable interrupt and timer */
        hdl->rom->regs->CMWCR.BIT.IC1IE = 0;
        hdl->rom->regs->CMWIOR.BIT.IC1E = 0;
    }
} /* End of function cmtw_ic1_ch0_isr() */
#endif /* End of #if CMTW_CFG_USE_CH0 == 1 */

#if CMTW_CFG_USE_CH1 == 1
/***********************************************************************************************************************
* Function Name: cmtw_cm_ch1_isr
* Description  : Compare match interrupt handler for channel 1.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(cmtw_cm_ch1_isr,VECT(CMTW1, CMWI1))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmtw_cm_ch1_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

    /* Get the handle for the channel */
     hdl = g_cmtw_handles[CMTW_CHANNEL_1];

     /* Call user callback if requested */
     if (CMTW_ACTION_CALLBACK & hdl->cm_action)
     {
         count = hdl->rom->regs->CMWCOR;
         cmtw_isr_common(CMTW_EVENT_CM, count, hdl);
     }

     /* Disable if repeat not requested e.g. one-shot */
     if (CMTW_ACTION_ONESHOT & hdl->cm_action)
     {
         /* Disable interrupt and timer */
         hdl->rom->regs->CMWCR.BIT.CMWIE = 0;
         hdl->rom->regs->CMWIOR.BIT.CMWE = 0;
     }
} /* End of function cmtw_cm_ch1_isr() */

/***********************************************************************************************************************
* Function Name: cmtw_oc0_ch1_isr
* Description  : Output compare 0 interrupt handler for channel 1.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(cmtw_oc0_ch1_isr, VECT_CMTW1_OC0I1)
R_BSP_ATTRIB_STATIC_INTERRUPT void cmtw_oc0_ch1_isr(void)
{
    uint32_t                count;
    cmtw_prv_ch_ctrl_info_t *hdl;

